; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-16)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	satellite5 - satellite
	instrument11 - instrument
	instrument12 - instrument
	instrument13 - instrument
	satellite6 - satellite
	instrument14 - instrument
	instrument15 - instrument
	instrument16 - instrument
	satellite7 - satellite
	instrument17 - instrument
	instrument18 - instrument
	satellite8 - satellite
	instrument19 - instrument
	instrument20 - instrument
	instrument21 - instrument
	satellite9 - satellite
	instrument22 - instrument
	image0 - mode
	image2 - mode
	infrared4 - mode
	thermograph1 - mode
	spectrograph3 - mode
	GroundStation0 - direction
	Star3 - direction
	GroundStation4 - direction
	Star2 - direction
	GroundStation1 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Planet7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Planet11 - direction
	Star12 - direction
	Star13 - direction
	Star14 - direction
	Star15 - direction
	Star16 - direction
	Phenomenon17 - direction
	Phenomenon18 - direction
	Planet19 - direction
	Star20 - direction
	Planet21 - direction
	Planet22 - direction
	Phenomenon23 - direction
	Star24 - direction
)
(:init
	(supports instrument0 infrared4)
	(calibration_target instrument0 Star3)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 image0)
	(supports instrument2 thermograph1)
	(supports instrument2 image2)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star15)
	(supports instrument3 thermograph1)
	(supports instrument3 image0)
	(calibration_target instrument3 GroundStation4)
	(supports instrument4 image2)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 Star3)
	(supports instrument5 spectrograph3)
	(supports instrument5 thermograph1)
	(supports instrument5 image2)
	(calibration_target instrument5 GroundStation4)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet10)
	(supports instrument6 image0)
	(calibration_target instrument6 GroundStation1)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star24)
	(supports instrument7 infrared4)
	(calibration_target instrument7 Star3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon9)
	(supports instrument8 spectrograph3)
	(calibration_target instrument8 GroundStation0)
	(supports instrument9 image0)
	(supports instrument9 image2)
	(supports instrument9 thermograph1)
	(calibration_target instrument9 Star3)
	(supports instrument10 image0)
	(supports instrument10 image2)
	(supports instrument10 spectrograph3)
	(calibration_target instrument10 Star2)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet19)
	(supports instrument11 image0)
	(calibration_target instrument11 Star3)
	(supports instrument12 infrared4)
	(supports instrument12 image0)
	(calibration_target instrument12 GroundStation4)
	(supports instrument13 spectrograph3)
	(calibration_target instrument13 Star2)
	(on_board instrument11 satellite5)
	(on_board instrument12 satellite5)
	(on_board instrument13 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Planet10)
	(supports instrument14 spectrograph3)
	(supports instrument14 thermograph1)
	(supports instrument14 image0)
	(calibration_target instrument14 Star3)
	(supports instrument15 image0)
	(supports instrument15 thermograph1)
	(supports instrument15 image2)
	(calibration_target instrument15 GroundStation4)
	(supports instrument16 spectrograph3)
	(supports instrument16 image2)
	(calibration_target instrument16 GroundStation0)
	(on_board instrument14 satellite6)
	(on_board instrument15 satellite6)
	(on_board instrument16 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Planet11)
	(supports instrument17 thermograph1)
	(supports instrument17 image2)
	(supports instrument17 image0)
	(calibration_target instrument17 GroundStation4)
	(supports instrument18 image2)
	(supports instrument18 thermograph1)
	(calibration_target instrument18 Star3)
	(on_board instrument17 satellite7)
	(on_board instrument18 satellite7)
	(power_avail satellite7)
	(pointing satellite7 Planet11)
	(supports instrument19 thermograph1)
	(supports instrument19 infrared4)
	(calibration_target instrument19 Star2)
	(supports instrument20 thermograph1)
	(calibration_target instrument20 GroundStation4)
	(supports instrument21 thermograph1)
	(calibration_target instrument21 Star2)
	(on_board instrument19 satellite8)
	(on_board instrument20 satellite8)
	(on_board instrument21 satellite8)
	(power_avail satellite8)
	(pointing satellite8 GroundStation4)
	(supports instrument22 spectrograph3)
	(supports instrument22 thermograph1)
	(supports instrument22 infrared4)
	(calibration_target instrument22 GroundStation1)
	(on_board instrument22 satellite9)
	(power_avail satellite9)
	(pointing satellite9 Planet11)
)
(:goal (and
	(pointing satellite5 Planet6)
	(pointing satellite7 Star3)
	(pointing satellite8 Star15)
	(pointing satellite9 Star16)
	(have_image Phenomenon5 thermograph1)
	(have_image Planet6 infrared4)
	(have_image Planet7 image0)
	(have_image Planet8 thermograph1)
	(have_image Phenomenon9 image2)
	(have_image Planet10 image0)
	(have_image Planet11 infrared4)
	(have_image Star12 image0)
	(have_image Star13 image0)
	(have_image Star14 thermograph1)
	(have_image Star15 image0)
	(have_image Star16 thermograph1)
	(have_image Phenomenon17 infrared4)
	(have_image Phenomenon18 spectrograph3)
	(have_image Star20 image0)
	(have_image Planet21 thermograph1)
	(have_image Planet22 image2)
	(have_image Phenomenon23 image0)
	(have_image Star24 infrared4)
))

)

; plan
1. (switch_on instrument22 satellite9)
   deleted: (power_avail satellite9)
   added: (power_on instrument22)
   goals met: 0 of 23
2. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 23
3. (turn_to satellite7 star3 planet11)
   deleted: (pointing satellite7 planet11)
   added: (pointing satellite7 star3)
   goals met: 1 of 23
4. (turn_to satellite8 star15 groundstation4)
   deleted: (pointing satellite8 groundstation4)
   added: (pointing satellite8 star15)
   goals met: 2 of 23
5. (turn_to satellite9 groundstation1 planet11)
   deleted: (pointing satellite9 planet11)
   added: (pointing satellite9 groundstation1)
   goals met: 2 of 23
6. (calibrate satellite9 instrument22 groundstation1)
   added: (calibrated instrument22)
   goals met: 2 of 23
7. (turn_to satellite9 phenomenon5 groundstation1)
   deleted: (pointing satellite9 groundstation1)
   added: (pointing satellite9 phenomenon5)
   goals met: 2 of 23
8. (take_image satellite9 phenomenon5 instrument22 thermograph1)
   added: (have_image phenomenon5 thermograph1)
   goals met: 3 of 23
9. (turn_to satellite9 planet6 phenomenon5)
   deleted: (pointing satellite9 phenomenon5)
   added: (pointing satellite9 planet6)
   goals met: 3 of 23
10. (take_image satellite9 planet6 instrument22 infrared4)
   added: (have_image planet6 infrared4)
   goals met: 4 of 23
11. (turn_to satellite9 planet8 planet6)
   deleted: (pointing satellite9 planet6)
   added: (pointing satellite9 planet8)
   goals met: 4 of 23
12. (take_image satellite9 planet8 instrument22 thermograph1)
   added: (have_image planet8 thermograph1)
   goals met: 5 of 23
13. (turn_to satellite9 planet11 planet8)
   deleted: (pointing satellite9 planet8)
   added: (pointing satellite9 planet11)
   goals met: 5 of 23
14. (take_image satellite9 planet11 instrument22 infrared4)
   added: (have_image planet11 infrared4)
   goals met: 6 of 23
15. (turn_to satellite9 star14 planet11)
   deleted: (pointing satellite9 planet11)
   added: (pointing satellite9 star14)
   goals met: 6 of 23
16. (take_image satellite9 star14 instrument22 thermograph1)
   added: (have_image star14 thermograph1)
   goals met: 7 of 23
17. (turn_to satellite9 star16 star14)
   deleted: (pointing satellite9 star14)
   added: (pointing satellite9 star16)
   goals met: 8 of 23
18. (take_image satellite9 star16 instrument22 thermograph1)
   added: (have_image star16 thermograph1)
   goals met: 9 of 23
19. (turn_to satellite5 planet6 planet10)
   deleted: (pointing satellite5 planet10)
   added: (pointing satellite5 planet6)
   goals met: 10 of 23
20. (turn_to satellite9 phenomenon17 star16)
   deleted: (pointing satellite9 star16)
   added: (pointing satellite9 phenomenon17)
   goals met: 9 of 23
21. (take_image satellite9 phenomenon17 instrument22 infrared4)
   added: (have_image phenomenon17 infrared4)
   goals met: 10 of 23
22. (turn_to satellite9 phenomenon18 phenomenon17)
   deleted: (pointing satellite9 phenomenon17)
   added: (pointing satellite9 phenomenon18)
   goals met: 10 of 23
23. (take_image satellite9 phenomenon18 instrument22 spectrograph3)
   added: (have_image phenomenon18 spectrograph3)
   goals met: 11 of 23
24. (turn_to satellite9 planet21 phenomenon18)
   deleted: (pointing satellite9 phenomenon18)
   added: (pointing satellite9 planet21)
   goals met: 11 of 23
25. (take_image satellite9 planet21 instrument22 thermograph1)
   added: (have_image planet21 thermograph1)
   goals met: 12 of 23
26. (turn_to satellite9 star24 planet21)
   deleted: (pointing satellite9 planet21)
   added: (pointing satellite9 star24)
   goals met: 12 of 23
27. (take_image satellite9 star24 instrument22 infrared4)
   added: (have_image star24 infrared4)
   goals met: 13 of 23
28. (turn_to satellite9 star16 star24)
   deleted: (pointing satellite9 star24)
   added: (pointing satellite9 star16)
   goals met: 14 of 23
29. (turn_to satellite0 groundstation1 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 groundstation1)
   goals met: 14 of 23
30. (calibrate satellite0 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 14 of 23
31. (turn_to satellite0 planet7 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet7)
   goals met: 14 of 23
32. (take_image satellite0 planet7 instrument2 image0)
   added: (have_image planet7 image0)
   goals met: 15 of 23
33. (turn_to satellite0 phenomenon9 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 phenomenon9)
   goals met: 15 of 23
34. (take_image satellite0 phenomenon9 instrument2 image2)
   added: (have_image phenomenon9 image2)
   goals met: 16 of 23
35. (turn_to satellite0 planet10 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet10)
   goals met: 16 of 23
36. (take_image satellite0 planet10 instrument2 image0)
   added: (have_image planet10 image0)
   goals met: 17 of 23
37. (turn_to satellite0 star12 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 star12)
   goals met: 17 of 23
38. (take_image satellite0 star12 instrument2 image0)
   added: (have_image star12 image0)
   goals met: 18 of 23
39. (turn_to satellite0 star13 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star13)
   goals met: 18 of 23
40. (take_image satellite0 star13 instrument2 image0)
   added: (have_image star13 image0)
   goals met: 19 of 23
41. (turn_to satellite0 star15 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star15)
   goals met: 19 of 23
42. (take_image satellite0 star15 instrument2 image0)
   added: (have_image star15 image0)
   goals met: 20 of 23
43. (turn_to satellite0 star20 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star20)
   goals met: 20 of 23
44. (take_image satellite0 star20 instrument2 image0)
   added: (have_image star20 image0)
   goals met: 21 of 23
45. (turn_to satellite0 planet22 star20)
   deleted: (pointing satellite0 star20)
   added: (pointing satellite0 planet22)
   goals met: 21 of 23
46. (take_image satellite0 planet22 instrument2 image2)
   added: (have_image planet22 image2)
   goals met: 22 of 23
47. (turn_to satellite0 phenomenon23 planet22)
   deleted: (pointing satellite0 planet22)
   added: (pointing satellite0 phenomenon23)
   goals met: 22 of 23
48. (take_image satellite0 phenomenon23 instrument2 image0)
   added: (have_image phenomenon23 image0)
   goals met: 23 of 23
